# CalloutCornerSheetRadius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CalloutCornerSheetRadius Property
ParameterTypeId Class See Also
---
"Corner Radius"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CalloutCornerSheetRadius { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CalloutCornerSheetRadius As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CalloutCornerSheetRadius {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace